<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"4dd038f231dc26aba46cc755ac4bf5ce2b180f06aa579044c36fd19c34540358","plan_job_ref":"Job Test actions using target and replace #487 at https://github.com/dflook/terraform-github-actions/actions/runs/15306967358","plan_out_hash":"36e43083dd34122e0084a6dc4a611e673d4c3e2bc1d2d51bd55afa358521b6da","plan_hash":"e4004218700e5a38c665717fb7fa2bf8d6090ad469fa0ece0485b6b510fba9dd","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
!~  count   = "1SZzGP5JbT" -> (known after apply)
!~  foreach = "8RzZfkjBm1" -> (known after apply)
```
</details>

:memo: Plan generated in [Test actions using target and replace #487](https://github.com/dflook/terraform-github-actions/actions/runs/15306967358)